Repository: yegetables/ok-duet-night-abyss
Catalog: i18n/*/LC_MESSAGES/ok.po
Languages: es_es, ja_jp, ko_kr, zh_tw

# 【武器经验80】-磐石水母-含配置参考-超时建议20s
source: 【Weapon EXP 80】-Rock Jellyfish-Includes config reference-Timeout recommended 20s
es_es: 【EXP de Arma 80】-Roca Medusa-Incluye referencia de configuración-Tiempo de espera recomendado 20s
ja_jp: 【武器経験値80】-岩石クラゲ-設定参考あり-タイムアウト推奨20秒
ko_kr: 【무기 경험치 80】-반석 해파리-설정 참고 포함-타임아웃 20초 권장

source: Fully automatic 80 escort mission, ported from emt, path author attribution is welcome. Requires Jellyfish main control, melee weapon select 0 refinement Spring Jade Halberd. Devil's Wedge configuration is Golden Swiftness+5, Purple Resonance Probe, Purple Swiftness Momentum+5, Purple Swiftness Plunge+5, do not carry other Devil's Wedges, panel attack speed is 1.67. In settings, set horizontal and vertical sensitivity to 1.0, and default camera distance to 1.3. After confirming your Devil's Wedge and settings, expand the configuration below and click 'I have read' to run.
es_es: Misión de escolta 80 totalmente automática, portada de emt, se agradece la atribución del autor de la ruta. Requiere control principal de Medusa, arma cuerpo a cuerpo seleccionar Alabarda de Jade de Primavera con 0 de refinamiento. La configuración de la Cuña del Diablo es Rapidez Dorada+5, Sonda de Resonancia Púrpura, Impulso de Rapidez Púrpura+5, Caída en Picado de Rapidez Púrpura+5, no lleves otras Cuñas del Diablo, la velocidad de ataque del panel es 1.67. En los ajustes, establece la sensibilidad horizontal y vertical en 1.0, y la distancia de la cámara predeterminada en 1.3. Después de confirmar tu Cuña del Diablo y los ajustes, despliega la configuración de abajo y haz clic en 'He leído' para ejecutar.
ja_jp: 全自動80護衛任務、emtからの移植、パス作者の署名を歓迎します。 クラゲをメイン操作で使用する必要があり、近接武器は0精錬の春玦戟を選択してください。魔の楔の構成は、金色の迅速+5、紫色の共鳴プローブ、紫色の迅速なチャージ+5、紫色の迅速な落下攻撃+5で、他の魔の楔は装備しないでください。パネルの攻撃速度は1.67です。 設定で、水平および垂直感度を1.0に、デフォルトのカメラ距離を1.3に設定します。自身の魔の楔と設定を確認した後、以下の設定を展開し、「読みました」をクリックして実行してください。
ko_kr: 완전 자동 80 호위 임무, emt에서 가져옴, 경로 작성자 서명 환영. 해파리 주 제어 사용 필요, 근접 무기는 0 제련 춘결극 선택. 마의 쐐기 구성은 금색 신속+5, 보라색 공명 탐사, 보라색 신속 축적+5, 보라색 신속 낙하+5이며, 다른 마의 쐐기는 휴대하지 마십시오. 패널 공격 속도는 1.67입니다. 설정에서 수평 및 수직 감도를 1.0으로, 기본 카메라 거리를 1.3으로 설정합니다. 자신의 마의 쐐기와 설정을 확인한 후 아래 구성을 펼치고 '읽었습니다'를 클릭하여 실행하십시오.

# 半自动 (只有基础操作)
source: Semi-auto (basic operations only)
es_es: Semiautomático (solo operaciones básicas)
ja_jp: 半自動（基本操作のみ）
ko_kr: 반자동 (기본 조작만)
zh_tw: 半自動 (只有基礎操作)

# 启动解锁机关
source: Activate Unlocking Mechanism
es_es: Activar Mecanismo de Desbloqueo
ja_jp: ロック解除機構を起動
ko_kr: 잠금 해제 장치 활성화

# 启用
source: Enable
es_es: Activar
ja_jp: 有効
ko_kr: 활성화
zh_tw: 啟用

# 委托手册指定轮次
source: Commission Handbook Specified Wave
es_es: Rondas Especificadas del Manual de Encargos
ja_jp: 依頼ハンドブック指定ラウンド
ko_kr: 의뢰 핸드북 지정 라운드
zh_tw: 委託手冊指定輪次

# 完成几次护送任务后停止
source: Stop after completing several escort missions
es_es: Detener después de completar varias misiones de escolta
ja_jp: 護衛任務を数回完了後に停止
ko_kr: 호위 임무를 여러 번 완료한 후 중지

# 必须勾选才能执行任务！
source: Must be checked to execute the task!
es_es: ¡Debe estar marcado para ejecutar la tarea!
ja_jp: 任務を実行するにはチェックを入れる必要があります！
ko_kr: 임무를 실행하려면 체크해야 합니다!
zh_tw: 必須勾選才能執行任務！

# 我已阅读注意事项并确认配置
source: I have read the precautions and confirmed the configuration
es_es: He leído las precauciones y confirmado la configuración
ja_jp: 注意事項を読み、設定を確認しました
ko_kr: 주의 사항을 읽고 구성을 확인했습니다
zh_tw: 我已閱讀注意事項並確認配置

# 移动延迟（秒）
source: Movement Delay (seconds)
es_es: Retraso de Movimiento (segundos)
ja_jp: 移動遅延（秒）
ko_kr: 이동 지연 (초)
zh_tw: 移動延遲（秒）

# 自动解锁轮盘
source: Auto Unlock Roulette
es_es: Desbloqueo Automático de Rueda
ja_jp: 自動でルーレットを解除
ko_kr: 자동 룰렛 잠금 해제
zh_tw: 自動解鎖輪盤

# 自动解锁迷宫
source: Auto Unlock Maze
es_es: Desbloqueo Automático de Laberinto
ja_jp: 自動で迷宮を解除
ko_kr: 자동 미로 잠금 해제
zh_tw: 自動解鎖迷宮

# 自动识别并进行迷宫解锁
source: Auto-identify and perform maze unlocking
es_es: Identificar y realizar desbloqueo de laberinto automáticamente
ja_jp: 自動で認識して迷宮を解除
ko_kr: 자동으로 미로를 인식하고 잠금 해제
zh_tw: 自動識別並進行迷宮解鎖

# 自动飞枪80护送（无需巧手）【需要游戏处于前台】
source: Auto Flying Spear 80 Escort (No Skillful required) [Requires game to be in foreground]
es_es: Escolta Automática con Lanza Voladora 80 (no requiere Habilidad) [Requiere que el juego esté en primer plano]
ja_jp: 自動飛槍80護衛（器用さ不要）【ゲームをフォアグラウンドにする必要があります】
ko_kr: 자동 비행창 80 호위 (재주 필요 없음) [게임이 전면에 있어야 함]
zh_tw: 自動飛槍80護送（無需巧手）【需要遊戲處於前台】

# 范例: 3,5,8
source: Example: 3,5,8
es_es: Ejemplo: 3,5,8
ja_jp: 例：3,5,8
ko_kr: 예시: 3,5,8
zh_tw: 範例: 3,5,8

# 通用型半自动
source: General Purpose Semi-Auto
es_es: Semiautomático de Propósito General
ja_jp: 汎用半自動
ko_kr: 범용 반자동
zh_tw: 通用型半自動

# 随便搞的，基于2k写的其他分辨率要是有问题就不管了，有bug也不用反馈因为拿到巧手后就不维护了(狗头)
source: Just a quick job, based on 2k, won't fix issues on other resolutions, no need to report bugs as it won't be maintained after getting Skillful (doge)
es_es: Hecho a la rápida, basado en 2k, no me haré cargo de problemas en otras resoluciones, no hace falta reportar bugs porque no se mantendrá después de conseguir la Habilidad (perro)
ja_jp: 適当に作ったので、2kを基準に書いた他の解像度で問題があっても知りません。バグ報告も不要です。器用さを手に入れたらメンテナンスしないので（笑）
ko_kr: 대충 만든 거라 2k 기준으로 작성해서 다른 해상도에서 문제 생겨도 책임 안 져요. 재주 얻으면 유지보수 안 할 거니까 버그 제보 안 해도 돼요 (개머리)
zh_tw: 隨便搞的，基於2k寫的其他解析度要是有問題就不管了，有bug也不用反饋因為拿到巧手後就不維護了(狗頭)

# 魔灵支援
source: Geniemon Support
es_es: Apoyo Geniemon
ja_jp: 魔霊支援
ko_kr: 마령 지원
zh_tw: 魔靈支援

# 【50mod】-中低速-水母-主控可调
source: 【50mod】-Medium-Low Speed-Jellyfish-Main Control Adjustable
es_es: 【50mod】-Velocidad media-baja-Medusa-Control principal ajustable
ja_jp: 【50mod】-中低速-クラゲ-メイン操作調整可能
ko_kr: 【50mod】-중저속-해파리-주 제어 조절 가능

# 【60mod&驱离密函】-磐石水母-主控可调（不要带黎瑟协战）-超时建议90s
source: 【60mod&Expulsion Casket】-Rock Jellyfish-Main Control Adjustable (Don't bring Lise in co-op)-Timeout recommended 90s
es_es: 【60mod&Cofre de Expulsión】-Roca Medusa-Control principal ajustable (No llevar a Lise en cooperativo)-Tiempo de espera recomendado 90s
ja_jp: 【60mod&駆除密函】-岩石クラゲ-メイン操作調整可能（リーゼの協力を入れないでください）-タイムアウト推奨90秒
ko_kr: 【60mod&퇴치 밀함】-반석 해파리-주 제어 조절 가능 (리세 협동 전투 데려가지 마세요)-타임아웃 90초 권장

# 【无飞枪80红豆（有巧手可后台）】-磐石黎瑟-使用前看文件夹内说明
source: 【No Flying Spear 80 Red Bean (Skillful can run in background)】-Rock Lise-Read instructions in folder before use
es_es: 【Sin Lanza Voladora 80 Frijol Rojo (con Habilidad puede ejecutarse en segundo plano)】-Roca Lise-Leer instrucciones en la carpeta antes de usar
ja_jp: 【飛槍なし80小豆（器用さあればバックグラウンド可）】-岩石リーゼ-使用前にフォルダ内の説明をお読みください
ko_kr: 【비행창 없음 80 팥 (재주 있으면 백그라운드 가능)】-반석 리세-사용 전 폴더 내 설명 참조

# 【武器材料60&70】-磐石水母
source: 【Weapon Material 60&70】-Rock Jellyfish
es_es: 【Material de Arma 60&70】-Roca Medusa
ja_jp: 【武器素材60&70】-岩石クラゲ
ko_kr: 【무기 재료 60&70】-반석 해파리

# 优先选择密函奖励
source: Prioritize Casket Rewards
es_es: Priorizar Recompensas de Cofre
ja_jp: 密函報酬を優先的に選択
ko_kr: 밀함 보상 우선 선택

# 启动机关解锁
source: Activate Mechanism Unlock
es_es: Activar Desbloqueo de Mecanismo
ja_jp: 機関ロック解除を起動
ko_kr: 장치 잠금 해제 활성화
zh_tw: 啟動機關解鎖

# 在上一选项启用时生效
source: Effective when the previous option is enabled
es_es: Efectivo cuando la opción anterior está habilitada
ja_jp: 前のオプションが有効な場合に適用
ko_kr: 이전 옵션 활성화 시 적용

# 持有数为0
source: Owned count is 0
es_es: Cantidad poseída es 0
ja_jp: 所持数0
ko_kr: 보유 수 0
zh_tw: 持有數為0

# 持有数最多
source: Highest owned count
es_es: Mayor cantidad poseída
ja_jp: 所持数最多
ko_kr: 보유 수 가장 많음
zh_tw: 持有數最多

# 持有数最少
source: Lowest owned count
es_es: Menor cantidad poseída
ja_jp: 所持数最少
ko_kr: 보유 수 가장 적음
zh_tw: 持有數最少

# 最大轮数
source: Max Rounds
es_es: Rondas Máximas
ja_jp: 最大ラウンド数
ko_kr: 최대 라운드
