Repository: yegetables/ok-duet-night-abyss
Catalog: i18n/*/LC_MESSAGES/ok.po
Languages: es_es, ja_jp, ko_kr, zh_tw

source: BAR_MIN_AREA
es_es: ÁREA_MÍNIMA_BARRA
ja_jp: バー最小面積
ko_kr: 바_최소_영역

source: CONTROL_ZONE_RATIO
es_es: RATIO_ZONA_CONTROL
ja_jp: コントロールゾーン比率
ko_kr: 제어_영역_비율

source: Combat Key
es_es: Tecla de Combate
ja_jp: 戦闘キー
ko_kr: 전투 키
zh_tw: 戰技

source: END_WAIT_SPACE
es_es: ESPACIO_ESPERA_FINAL
ja_jp: 終了待機スペース
ko_kr: 종료_대기_공간

source: Game Hotkey Config
es_es: Configuración de Teclas Rápidas del Juego
ja_jp: ゲームホットキー設定
ko_kr: 게임 단축키 설정
zh_tw: 遊戲快速鍵設定

source: Geniemon Key
es_es: Tecla Geniemon
ja_jp: ゲニモンキー
ko_kr: 게니몬 키
zh_tw: 魔靈支援

source: ICON_MAX_AREA
es_es: ÁREA_MÁXIMA_ICONO
ja_jp: アイコン最大面積
ko_kr: 아이콘_최대_영역

source: ICON_MIN_AREA
es_es: ÁREA_MÍNIMA_ICONO
ja_jp: アイコン最小面積
ko_kr: 아이콘_최소_영역

source: In Game Hotkey for Skills
es_es: Teclas Rápidas de Habilidades en el Juego
ja_jp: ゲーム内スキルホットキー
ko_kr: 게임 내 스킬 단축키
zh_tw: 遊戲內技能快速鍵

source: MAX_END_SEC
es_es: MÁX_SEG_FINAL
ja_jp: 最大終了秒数
ko_kr: 최대_종료_초

source: MAX_FIGHT_SEC
es_es: MÁX_SEG_LUCHA
ja_jp: 最大戦闘秒数
ko_kr: 최대_전투_초

source: MAX_ROUNDS
es_es: MÁX_RONDAS
ja_jp: 最大ラウンド数
ko_kr: 최대_라운드

source: MAX_START_SEC
es_es: MÁX_SEG_INICIO
ja_jp: 最大開始秒数
ko_kr: 최대_시작_초

source: Ultimate Key
es_es: Tecla de Habilidad Definitiva
ja_jp: 究極スキルキー
ko_kr: 궁극기 키
zh_tw: 終結技

source: right
es_es: derecha
ja_jp: 右
ko_kr: 오른쪽

# v2.996版本 10 30火 60 70皎皎币 70调停 花生
source: v2.996 Version 10 30 Fire 60 70 Shell Credits 70 Mediation Peanut
es_es: v2.996 Versión 10 30 Fuego 60 70 Monedas Shell 70 Mediación Cacahuete
ja_jp: v2.996バージョン 10 30火 60 70皎皎コイン 70調停 ピーナッツ
ko_kr: v2.996 버전 10 30 불 60 70 조개 화폐 70 중재 땅콩

# 不使用
source: Not Used
es_es: No usar
ja_jp: 使用しない
ko_kr: 사용 안 함
zh_tw: 不使用

# 主画面侦测
source: Main Screen Detection
es_es: Detección de pantalla principal
ja_jp: メイン画面検出
ko_kr: 메인 화면 감지
zh_tw: 主畫面偵測

# 使用外部移动逻辑自动打本
source: Use external movement logic for auto-dungeon
es_es: Usar lógica de movimiento externa para mazmorras automáticas
ja_jp: 外部移動ロジックを使用して自動周回
ko_kr: 외부 이동 로직을 사용하여 자동 사냥
zh_tw: 使用外部移動邏輯自動打本

# 使用技能
source: Use Skill
es_es: Usar Habilidad
ja_jp: スキルを使用
ko_kr: 스킬 사용

# 使用键盘
source: Use Keyboard
es_es: Usar Teclado
ja_jp: キーボードを使用
ko_kr: 키보드 사용
zh_tw: 使用鍵盤

# 全自动
source: Full-Auto
ja_jp: 全自動
ko_kr: 완전 자동
zh_tw: 全自動

# 刷几次
source: Number of Runs
es_es: Número de intentos
ja_jp: 周回数
ko_kr: 반복 횟수

# 刷武器密函时不建议使用
source: Not recommended when farming Weapon Caskets
es_es: No recomendado al farmear Cajas de Armas
ja_jp: 武器密函の周回時には非推奨
ko_kr: 무기 밀함 파밍 시 사용 비권장

# 副本类型
source: Dungeon Type
es_es: Tipo de Mazmorra
ja_jp: ダンジョンタイプ
ko_kr: 던전 유형
zh_tw: 副本類型

# 半自动
source: Semi-Auto
ja_jp: 半自動
ko_kr: 반자동
zh_tw: 半自動

# 单次提示响几次
source: Alert sounds per notification
es_es: Sonidos de alerta por notificación
ja_jp: 1回の通知音の回数
ko_kr: 알림당 소리 횟수
zh_tw: 單次提示響幾次

# 发出声音提醒
source: Sound Alert
es_es: Alerta de Sonido
ja_jp: 音で通知
ko_kr: 소리 알림

# 右键按住多久(秒)
source: Right-click hold duration (sec)
es_es: Duración de pulsación del clic derecho (seg)
ja_jp: 右クリック長押し時間(秒)
ko_kr: 오른쪽 클릭 유지 시간(초)
zh_tw: 右鍵按住多久(秒)

# 右键释放后等待多久(秒)
source: Wait after right-click release (sec)
es_es: Espera tras soltar el clic derecho (seg)
ja_jp: 右クリック解放後の待機時間(秒)
ko_kr: 오른쪽 클릭 해제 후 대기 시간(초)
zh_tw: 右鍵釋放後等待多久(秒)

# 启动任务时和特定场景下会将鼠标移动到安全位置
source: Move mouse to a safe position on task start and in specific scenes
es_es: Mover el ratón a una posición segura al iniciar la tarea y en escenas específicas
ja_jp: 任務開始時や特定シーンでマウスカーソルを安全な位置に移動
ko_kr: 임무 시작 및 특정 상황에서 마우스를 안전한 위치로 이동
zh_tw: 啟動任務時和特定場景下會將滑鼠移動到安全位置

# 启用自动穿引共鸣
source: Enable Auto Resonance Probe
es_es: Activar Sonda de Resonancia Automática
ja_jp: 自動で共鳴プローブを有効化
ko_kr: 자동 공명 탐사 활성화

# 在需要时发出声音提醒
source: Play sound alert when needed
es_es: Reproducir alerta de sonido cuando sea necesario
ja_jp: 必要な時に音で通知
ko_kr: 필요시 소리 알림
zh_tw: 在需要時發出聲音提醒

# 在需要跑图时时启用触发任务的自动穿引共鸣
source: Enable task-triggering Resonance Probe when map traversal is needed
es_es: Activar Sonda de Resonancia que activa tareas al necesitar recorrer el mapa
ja_jp: マップ移動が必要な際に任務を触発する共鳴プローブを自動で有効化
ko_kr: 맵 이동 필요 시 임무를 발동하는 자동 공명 탐사 활성화

# 外部文件夹
source: External Folder
es_es: Carpeta Externa
ja_jp: 外部フォルダー
ko_kr: 외부 폴더
zh_tw: 外部資料夾

# 如果不在可操控角色的画面则结束任务
source: End task if not on the controllable character screen
es_es: Finalizar tarea si no está en la pantalla del personaje controlable
ja_jp: 操作可能なキャラクター画面でない場合は任務を終了
ko_kr: 조작 가능한 캐릭터 화면이 아니면 임무 종료
zh_tw: 如果不在可操控角色的畫面則結束任務

# 如果是无尽关卡，选择打几个轮次
source: For endless stages, select number of Wave
es_es: Para fases infinitas, seleccione el número de rondas
ja_jp: エンドレスステージの場合、ラウンド数を選択
ko_kr: 무한 스테이지인 경우, 라운드 수 선택
zh_tw: 如果是無盡關卡，選擇打幾個輪次

# 委托手册
source: Commission Handbook
es_es: Manual de Encargos
ja_jp: 依頼ハンドブック
ko_kr: 의뢰 핸드북
zh_tw: 委託手冊

# 左键按住多久
source: Left-click hold duration
es_es: Duración de pulsación del clic izquierdo
ja_jp: 左クリック長押し時間
ko_kr: 왼쪽 클릭 유지 시간
zh_tw: 左鍵按住多久

# 左键释放后等待多久
source: Wait after left-click release
es_es: Espera tras soltar el clic izquierdo
ja_jp: 左クリック解放後の待機時間
ko_kr: 왼쪽 클릭 해제 후 대기 시간
zh_tw: 左鍵釋放後等待多久

# 开始阶段超时(秒)
source: Start phase timeout (sec)
es_es: Tiempo de espera de la fase inicial (seg)
ja_jp: 開始フェーズのタイムアウト(秒)
ko_kr: 시작 단계 시간 초과(초)
zh_tw: 開始階段超時(秒)

# 弹出通知
source: Popup Notification
es_es: Notificación Emergente
ja_jp: 通知をポップアップ
ko_kr: 팝업 알림
zh_tw: 彈出通知

# 总共刷多少次副本
source: Total number of dungeon runs
es_es: Número total de intentos de mazmorra
ja_jp: ダンジョンの総周回数
ko_kr: 총 던전 반복 횟수

# 战技
source: Combat Skill
es_es: Habilidad de Combate
ja_jp: 戦技
ko_kr: 전투 스킬
zh_tw: 戰技

# 打几个轮次
source: Number of Wave
es_es: Número de rondas
ja_jp: ラウンド数
ko_kr: 라운드 수
zh_tw: 打幾個輪次

# 扼守无尽
source: Endless Defense
es_es: Defensa Infinita
ja_jp: エンドレス防衛
ko_kr: 무한 수비
zh_tw: 扼守無盡

# 技能
source: Skill
es_es: Habilidad
ja_jp: スキル
ko_kr: 스킬
zh_tw: 技能

# 技能释放频率
source: Skill Cast Frequency
es_es: Frecuencia de Lanzamiento de Habilidad
ja_jp: スキル使用頻度
ko_kr: 스킬 시전 빈도

# 挂机相关设置
source: AFK Related Settings
es_es: Ajustes Relacionados con AFK
ja_jp: 放置関連設定
ko_kr: 자동 사냥 관련 설정
zh_tw: 掛機相關設定

# 挂机设置
source: AFK Settings
es_es: Ajustes de AFK
ja_jp: 放置設定
ko_kr: 자동 사냥 설정
zh_tw: 掛機設定

# 按下时间
source: Press Duration
es_es: Duración de Pulsación
ja_jp: 押下時間
ko_kr: 누르는 시간
zh_tw: 按下時間

# 按住普攻
source: Hold Normal Attack
es_es: Mantener Ataque Normal
ja_jp: 通常攻撃長押し
ko_kr: 일반 공격 길게 누르기
zh_tw: 按住普攻

# 探险无尽
source: Endless Exploration
es_es: Exploración Infinita
ja_jp: エンドレス探検
ko_kr: 무한 탐험
zh_tw: 探險無盡

# 提示音
source: Alert Sound
es_es: Sonido de Alerta
ja_jp: 通知音
ko_kr: 알림음
zh_tw: 提示音

# 无悠闲全自动钓鱼 (原作者: B站无敌大蜜瓜)，如果识别不到鱼条修改配置降低面积要求
source: Leisurely Auto-Fishing (Original Author: Bilibili 无敌大蜜瓜), if the fishing bar is not detected, lower the area requirement in the configuration
es_es: Pesca Automática Relajada (Autor Original: Bilibili 无敌大蜜瓜), si la barra de pesca no se detecta, reduzca el requisito de área en la configuración
ja_jp: のんびり全自動釣り (原作者: Bilibili 無敵大蜜瓜)、魚のバーが認識できない場合は設定で面積要件を下げてください
ko_kr: 느긋한 자동 낚시 (원작자: Bilibili 無敵大蜜瓜), 낚시 바가 인식되지 않으면 설정에서 면적 요구 사항을 낮추세요

# 是否在任务中随机移动
source: Randomly move during the task
es_es: Moverse aleatoriamente durante la tarea
ja_jp: 任務中にランダム移動するか
ko_kr: 임무 중 무작위 이동 여부
zh_tw: 是否在任務中隨機移動

# 是否弹出windows通知
source: Popup Windows notifications
es_es: Mostrar notificaciones de Windows
ja_jp: Windows通知をポップアップするか
ko_kr: Windows 알림 팝업 여부
zh_tw: 是否彈出windows通知

# 普攻
source: Normal Attack
es_es: Ataque Normal
ja_jp: 通常攻撃
ko_kr: 일반 공격
zh_tw: 普攻

# 最大轮数(0=无限制)
source: Max Rounds (0=unlimited)
es_es: Rondas Máximas (0=ilimitado)
ja_jp: 最大ラウンド数(0=無制限)
ko_kr: 최대 라운드 (0=무제한)

# 毎几秒释放一次技能
source: Cast skill every few seconds
es_es: Lanzar habilidad cada pocos segundos
ja_jp: 数秒ごとにスキルを1回使用
ko_kr: 몇 초마다 스킬 시전

# 每轮结束等待时间(秒)
source: Wait time after each round (sec)
es_es: Tiempo de espera después de cada ronda (seg)
ja_jp: 各ラウンド終了後の待機時間(秒)
ko_kr: 라운드 종료 후 대기 시간(초)
zh_tw: 每輪結束等待時間(秒)

# 波次超时后将发出提示
source: Alert on wave timeout
es_es: Alerta al exceder el tiempo de la oleada
ja_jp: ウェーブタイムアウト後に通知
ko_kr: 웨이브 시간 초과 시 알림
zh_tw: 波次超時後將發出提示

# 溜鱼阶段超时(秒)
source: Fish fighting phase timeout (sec)
es_es: Tiempo de espera de la fase de lucha con el pez (seg)
ja_jp: 魚との格闘フェーズのタイムアウト(秒)
ko_kr: 물고기 싸움 단계 시간 초과(초)
zh_tw: 溜魚階段超時(秒)

# 激活键
source: Activation Key
es_es: Tecla de Activación
ja_jp: 有効化キー
ko_kr: 활성화 키
zh_tw: 啟用鍵

# 示例-无巧手30火突破素材(1080p) by望目
source: Example - No-Dex 30 Fire Ascend Material (1080p) by 望目
es_es: Ejemplo - Material de Ascensión de Fuego 30 sin Destreza (1080p) por 望目
ja_jp: サンプル - 器用さなし30火突破素材(1080p) by望目
ko_kr: 예시 - 재주 없음 30 불 속성 돌파 재료(1080p) by 望目
zh_tw: 範例-無巧手30火突破素材(1080p) by望目

# 终结技
source: Ultimate
es_es: Habilidad Definitiva
ja_jp: 終結技
ko_kr: 궁극기
zh_tw: 終結技

# 结束阶段超时(秒)
source: End phase timeout (sec)
es_es: Tiempo de espera de la fase final (seg)
ja_jp: 終了フェーズのタイムアウト(秒)
ko_kr: 종료 단계 시간 초과(초)
zh_tw: 結束階段超時(秒)

# 自动30/65级魔之楔本
source: Auto Lvl 30/65 Devil's Wedge Dungeon
es_es: Mazmorra Automática de Cuña del Diablo Nv 30/65
ja_jp: 自動30/65レベル魔の楔ダンジョン
ko_kr: 자동 30/65레벨 마의 쐐기 던전
zh_tw: 自動30/65級魔之楔本

# 自动70级皎皎币本
source: Auto Lvl 70 Shell Credit Dungeon
es_es: Mazmorra Automática de Créditos Shell Nv 70
ja_jp: 自動70レベル皎皎コインダンジョン
ko_kr: 자동 70레벨 조개 화폐 던전
zh_tw: 自動70級皎皎幣本

# 自动勘察
source: Auto Excavation
es_es: Exploración Automática
ja_jp: 自動調査
ko_kr: 자동 탐사
zh_tw: 自動勘察

# 自动战斗
source: Auto Combat
es_es: Combate Automático
ja_jp: 自動戦闘
ko_kr: 자동 전투
zh_tw: 自動戰鬥

# 自动扼守
source: Auto Defence
es_es: Defensa Automática
ja_jp: 自動防衛
ko_kr: 자동 수비
zh_tw: 自動扼守

# 自动探险
source: Auto Exploration
es_es: Exploración Automática
ja_jp: 自動探検
ko_kr: 자동 탐험
zh_tw: 自動探險

# 自动点击肉鸽对话
source: Auto-click Roguelike dialogue
es_es: Clic automático en diálogos Roguelike
ja_jp: ローグライク会話の自動クリック
ko_kr: 로그라이크 대화 자동 클릭

# 自动穿引共鸣
source: Auto Resonance Probe
es_es: Sonda de Resonancia Automática
ja_jp: 自動共鳴プローブ
ko_kr: 자동 공명 탐사
zh_tw: 自動穿引共鳴

# 自动肉鸽对话
source: Auto Roguelike Dialogue
es_es: Diálogo Roguelike Automático
ja_jp: 自動ローグライク会話
ko_kr: 자동 로그라이크 대화
zh_tw: 自動肉鴿對話

# 自动花序弓蓄力瞄准
source: Auto Inflorescence Bow Charged Aiming
es_es: Apuntado con Carga Automática del Arco de Inflorescencia
ja_jp: 花序弓の自動チャージ照準
ko_kr: 자동 꽃차례 활 차지 조준
zh_tw: 自動花序弓蓄力瞄準

# 自动选择首个密函和密函奖励
source: Auto-select first casket and its reward
es_es: Seleccionar automáticamente la primera caja y su recompensa
ja_jp: 最初の密函と報酬を自動選択
ko_kr: 첫 번째 밀함 및 보상 자동 선택

# 自动释放技能
source: Auto Cast Skill
es_es: Lanzamiento Automático de Habilidad
ja_jp: 自動スキル使用
ko_kr: 자동 스킬 시전
zh_tw: 自動釋放技能

# 自动钓鱼
source: Auto Fishing
es_es: Pesca Automática
ja_jp: 自動釣り
ko_kr: 자동 낚시
zh_tw: 自動釣魚

# 自动驱离
source: Auto Expulsion
es_es: Repeler Automáticamente
ja_jp: 自動駆除
ko_kr: 자동 퇴치
zh_tw: 自動驅離

# 超时后将发出提示
source: Alert on timeout
es_es: Alerta por tiempo de espera agotado
ja_jp: タイムアウト後に通知
ko_kr: 시간 초과 시 알림
zh_tw: 超時後將發出提示

# 超时后将重启任务
source: Restart task on timeout
es_es: Reiniciar tarea por tiempo de espera agotado
ja_jp: タイムアウト後に任務を再起動
ko_kr: 시간 초과 시 임무 재시작
zh_tw: 超時後將重啟任務

# 超时时间
source: Timeout
es_es: Tiempo de Espera
ja_jp: タイムアウト時間
ko_kr: 시간 초과
zh_tw: 超時時間

# 跳过对话
source: Skip Dialogue
es_es: Saltar Diálogo
ja_jp: 会話をスキップ
ko_kr: 대화 건너뛰기

# 轮次
source: Wave
es_es: Rondas
ja_jp: ラウンド
ko_kr: 라운드
zh_tw: 輪次

# 选择mod目录下的外部逻辑
source: Select external logic from mod directory
es_es: Seleccionar lógica externa del directorio de mods
ja_jp: modディレクトリから外部ロジックを選択
ko_kr: mod 디렉토리에서 외부 로직 선택
zh_tw: 選擇mod目錄下的外部邏輯

# 释放间隔
source: Cast Interval
es_es: Intervalo de Lanzamiento
ja_jp: 使用間隔
ko_kr: 시전 간격
zh_tw: 釋放間隔

# 键盘
source: Keyboard
es_es: Teclado
ja_jp: キーボード
ko_kr: 키보드
zh_tw: 鍵盤

# 间隔时间
source: Interval
es_es: Intervalo
ja_jp: 間隔時間
ko_kr: 간격 시간
zh_tw: 間隔時間

# 防止鼠标干扰
source: Prevent Mouse Interference
es_es: Prevenir Interferencia del Ratón
ja_jp: マウス干渉を防止
ko_kr: 마우스 간섭 방지
zh_tw: 防止滑鼠干擾

# 随机游走
source: Random Walk
es_es: Paseo Aleatorio
ja_jp: ランダムウォーク
ko_kr: 무작위 배회
zh_tw: 隨機遊走

# 需主动激活
source: Requires manual activation
es_es: Requiere activación manual
ja_jp: 手動で有効化が必要
ko_kr: 수동 활성화 필요
zh_tw: 需主動啟用

# 需主动激活，运行中也可使用左键打断
source: Requires manual activation, can be interrupted by left-click
es_es: Requiere activación manual, se puede interrumpir con el clic izquierdo
ja_jp: 手動で有効化が必要、実行中は左クリックで中断可能
ko_kr: 수동 활성화 필요, 실행 중 왼쪽 클릭으로 중단 가능
zh_tw: 需主動啟用，運行中也可使用左鍵打斷

# 需主动激活，运行中可使用右键或左键打断
source: Requires manual activation, can be interrupted by right or left-click
es_es: Requiere activación manual, se puede interrumpir con el clic derecho o izquierdo
ja_jp: 手動で有効化が必要、実行中は右または左クリックで中断可能
ko_kr: 수동 활성화 필요, 실행 중 오른쪽 또는 왼쪽 클릭으로 중단 가능
zh_tw: 需主動啟用，運行中可使用右鍵或左鍵打斷

# 鱼条最小面积(像素)
source: Min fishing bar area (pixels)
es_es: Área mínima de la barra de pesca (píxeles)
ja_jp: 魚のバーの最小面積(ピクセル)
ko_kr: 낚시 바 최소 면적(픽셀)

# 鱼标按空格区域占比(0-0.5)
source: Fishing marker spacebar press zone ratio (0-0.5)
es_es: Ratio de la zona de pulsación de espacio del marcador de pesca (0-0.5)
ja_jp: 魚のマーカーのスペースキー押下エリア比率(0-0.5)
ko_kr: 낚시 마커 스페이스바 누름 영역 비율(0-0.5)

# 鱼标最大面积(像素)
source: Max fishing marker area (pixels)
es_es: Área máxima del marcador de pesca (píxeles)
ja_jp: 魚のマーカーの最大面積(ピクセル)
ko_kr: 낚시 마커 최대 면적(픽셀)

# 鱼标最小面积(像素)
source: Min fishing marker area (pixels)
es_es: Área mínima del marcador de pesca (píxeles)
ja_jp: 魚のマーカーの最小面積(ピクセル)
ko_kr: 낚시 마커 최소 면적(픽셀)

# 默认
source: Default
es_es: Predeterminado
ja_jp: デフォルト
ko_kr: 기본값
zh_tw: 預設

# 鼠标键或键盘按键
source: Mouse button or keyboard key
es_es: Botón del ratón o tecla del teclado
ja_jp: マウスボタンまたはキーボードキー
ko_kr: 마우스 버튼 또는 키보드 키
zh_tw: 滑鼠鍵或鍵盤按鍵

source: Check Monthly Card
es_es: Comprobar Tarjeta Mensual
ja_jp: 月間カードを確認
ko_kr: 월간 카드 확인
zh_tw: 是否檢查月卡

source: Check for monthly card to avoid interruption of tasks
es_es: Comprobar la tarjeta mensual para evitar la interrupción de tareas
ja_jp: タスクの中断を避けるために月間カードを確認
ko_kr: 작업 중단 방지를 위해 월간 카드 확인
zh_tw: 設定避免小月卡彈跳窗打斷任務

source: Monthly Card Config
es_es: Configuración de Tarjeta Mensual
ja_jp: 月間カード設定
ko_kr: 월간 카드 설정
zh_tw: 小月卡設定

source: Monthly Card Time
es_es: Hora de Tarjeta Mensual
ja_jp: 月間カード時間
ko_kr: 월간 카드 시간
zh_tw: 月卡時間

# OK-角色经验本50-巧手(主控猪妹,ai水母280范围,超时时间可设置10秒内保证跑错重开)
source: OK-Character EXP Dungeon 50-Skillful (Main control Piggy, AI Jellyfish 280 range, timeout can be set within 10 seconds to ensure restart if path is wrong)
es_es: OK-Mazmorra de EXP de Personaje 50-Habilidad (Control principal: Piggy, IA Medusa 280 de alcance, tiempo de espera configurable en 10 segundos para asegurar reinicio si hay error de ruta)
ja_jp: OK-キャラクター経験値ダンジョン50-器用さ(メイン操作: 豚娘, AIクラゲ280範囲, タイムアウト時間は10秒以内に設定可能で、ルート間違い時の再開を保証)
ko_kr: OK-캐릭터 경험치 던전 50-능숙 (주 제어: 돼지 소녀, AI 해파리 280 범위, 시간 초과는 10초 이내로 설정하여 경로 오류 시 재시작 보장)

# OK-角色经验本60-兼容无巧手(主控成年女磐石,ai水母280范围)
source: OK-Character EXP Dungeon 60-Compatible without Skillful (Main control Adult Female Rock, AI Jellyfish 280 range)
es_es: OK-Mazmorra de EXP de Personaje 60-Compatible sin Habilidad (Control principal: Adulto Femenino de Roca, IA Medusa 280 de alcance)
ja_jp: OK-キャラクター経験値ダンジョン60-器用さなし互換(メイン操作: 成人女性岩石, AIクラゲ280範囲)
ko_kr: OK-캐릭터 경험치 던전 60-능숙 없음 호환 (주 제어: 성인 여성 바위, AI 해파리 280 범위)

source: Turn on to avoid interruption by monthly card when executing tasks
es_es: Activar para evitar la interrupción por tarjeta mensual al ejecutar tareas
ja_jp: タスク実行中に月間カードによる中断を避けるためにオンにする
ko_kr: 작업 실행 시 월간 카드에 의한 중단을 피하기 위해 켜기
zh_tw: 開啟避免掛任務的時候被月卡中斷

source: Your computer's local time when the monthly card will popup, hour in (1-24)
es_es: Hora local de su ordenador cuando aparecerá la tarjeta mensual, hora en (1-24)
ja_jp: 月間カードがポップアップする際のコンピューターの現地時間、時間(1-24)
ko_kr: 월간 카드가 팝업될 컴퓨터의 현지 시간, 시간 (1-24)
zh_tw: 幾點會跳出月卡提示, 本機電腦時間(1-24)

# ok-55,70MOD(主控水母280范围)
source: ok-55,70MOD (Main control Jellyfish 280 range)
es_es: ok-55,70MOD (Control principal: Medusa 280 de alcance)
ja_jp: ok-55,70MOD(メイン操作: クラゲ280範囲)
ko_kr: ok-55,70MOD (주 제어: 해파리 280 범위)

# ok-80MOD(主控水母高范围)
source: ok-80MOD (Main control Jellyfish high range)
es_es: ok-80MOD (Control principal: Medusa de alto alcance)
ja_jp: ok-80MOD(メイン操作: クラゲ高範囲)
ko_kr: ok-80MOD (주 제어: 해파리 고범위)

# ok-武器突破材料70-巧手(水母磐石280范围)
source: ok-Weapon Breakthrough Material 70-Skillful (Jellyfish Rock 280 range)
es_es: ok-Material de Ascensión de Arma 70-Habilidad (Medusa Roca 280 de alcance)
ja_jp: ok-武器突破素材70-器用さ(クラゲ岩石280範囲)
ko_kr: ok-무기 돌파 재료 70-능숙 (해파리 바위 280 범위)

# ok-武器突破材料70-巧手稳定版(水母磐石280范围)
source: ok-Weapon Breakthrough Material 70-Skillful Stable Version (Jellyfish Rock 280 range)
es_es: ok-Material de Ascensión de Arma 70-Habilidad Versión Estable (Medusa Roca 280 de alcance)
ja_jp: ok-武器突破素材70-器用さ安定版(クラゲ岩石280範囲)
ko_kr: ok-무기 돌파 재료 70-능숙 안정 버전 (해파리 바위 280 범위)

# ok-武器经验本70(水母磐石280范围)
source: ok-Weapon EXP Dungeon 70 (Jellyfish Rock 280 range)
es_es: ok-Mazmorra de EXP de Arma 70 (Medusa Roca 280 de alcance)
ja_jp: ok-武器経験値ダンジョン70(クラゲ岩石280範囲)
ko_kr: ok-무기 경험치 던전 70 (해파리 바위 280 범위)

# ok-武器经验本80(水母磐石280范围)
source: ok-Weapon EXP Dungeon 80 (Jellyfish Rock 280 range)
es_es: ok-Mazmorra de EXP de Arma 80 (Medusa Roca 280 de alcance)
ja_jp: ok-武器経験値ダンジョン80(クラゲ岩石280範囲)
ko_kr: ok-무기 경험치 던전 80 (해파리 바위 280 범위)

# ok-火巧10-巧手(磐石)
source: ok-Fire Skillful 10-Skillful (Rock)
es_es: ok-Fuego Habilidad 10-Habilidad (Roca)
ja_jp: ok-火器用さ10-器用さ(岩石)
ko_kr: ok-불 능숙 10-능숙 (바위)

# ok-火巧30,60-巧手(磐石30-14轮,60-8轮)
source: ok-Fire Skillful 30,60-Skillful (Rock 30-14 rounds, 60-8 rounds)
es_es: ok-Fuego Habilidad 30,60-Habilidad (Roca 30-14 rondas, 60-8 rondas)
ja_jp: ok-火器用さ30,60-器用さ(岩石30-14ラウンド,60-8ラウンド)
ko_kr: ok-불 능숙 30,60-능숙 (바위 30-14 라운드, 60-8 라운드)

# ok-火巧角色突破材料70-巧手(磐石,火10通用)
source: ok-Fire Skillful Character Breakthrough Material 70-Skillful (Rock, Fire 10 universal)
es_es: ok-Material de Ascensión de Personaje de Fuego Habilidad 70-Habilidad (Roca, Fuego 10 universal)
ja_jp: ok-火器用さキャラクター突破素材70-器用さ(岩石,火10共通)
ko_kr: ok-불 능숙 캐릭터 돌파 재료 70-능숙 (바위, 불 10 공용)

# ok-皎皎币60
source: ok-Shell Credits 60
es_es: ok-Monedas Shell 60
ja_jp: ok-皎皎コイン60
ko_kr: ok-조개 화폐 60

# 60角色经验本
source: 60 Character EXP Dungeon
es_es: Mazmorra de EXP de Personaje 60
ja_jp: 60キャラクター経験値ダンジョン
ko_kr: 60 캐릭터 경험치 던전

source: Auto Pick
es_es: Recogida Automática
ja_jp: 自動ピックアップ
ko_kr: 자동 줍기
zh_tw: 自動擷取

source: Auto Pick in Game World
es_es: Recogida Automática en el Mundo del Juego
ja_jp: ゲームワールドでの自動ピックアップ
ko_kr: 게임 월드 자동 줍기
zh_tw: 大世界自動擷取

# 优先选择持有数为0的密函奖励
source: Prioritize casket rewards with 0 owned
es_es: Priorizar recompensas de cofres con 0 unidades poseídas
ja_jp: 所持数0の密函報酬を優先的に選択
ko_kr: 보유 수 0인 밀함 보상 우선 선택

# 刷武器密函时推荐同时开启下一选项
source: Recommended to enable the next option when farming weapon caskets
es_es: Se recomienda activar la siguiente opción al farmear cofres de armas
ja_jp: 武器密函を周回する際は、次のオプションも同時に有効にすることをお勧めします
ko_kr: 무기 밀함 파밍 시 다음 옵션도 함께 활성화하는 것을 권장합니다

# 在上一选项启用时生效，多个目标时选择靠左的
source: Effective when the previous option is enabled, choose the leftmost if multiple targets
es_es: Activo cuando la opción anterior está habilitada, si hay múltiples objetivos, selecciona el de la izquierda
ja_jp: 前のオプションが有効な場合に適用され、複数のターゲットがある場合は左側のものを選択
ko_kr: 이전 옵션 활성화 시 적용되며, 여러 대상이 있을 경우 왼쪽을 선택

# 完成时播放提示音
source: Play alert sound upon completion
es_es: Reproducir sonido de alerta al finalizar
ja_jp: 完了時に通知音を再生
ko_kr: 완료 시 알림음 재생

# 开局向前走
source: Walk forward at start
es_es: Avanzar al inicio
ja_jp: 開始時に前進
ko_kr: 시작 시 앞으로 이동
zh_tw: 開局向前走

# 开局向前走几秒
source: Walk forward for a few seconds at start
es_es: Avanzar unos segundos al inicio
ja_jp: 開始時に数秒前進
ko_kr: 시작 시 몇 초간 앞으로 이동
zh_tw: 開局向前走幾秒

# 开局重置角色位置
source: Reset character position at start
es_es: Reiniciar posición del personaje al inicio
ja_jp: 開始時にキャラクター位置をリセット
ko_kr: 시작 시 캐릭터 위치 초기화
zh_tw: 開局重置角色位置

# 挂机模式
source: AFK Mode
es_es: Modo AFK
ja_jp: 放置モード
ko_kr: AFK 모드
zh_tw: 掛機模式

# 无悠闲全自动钓鱼 (原作者: B站无敌大蜜瓜)
source: Leisurely Auto-Fishing (Original Author: Bilibili 无敌大蜜瓜)
es_es: Pesca Automática Relajada (Autor Original: Bilibili 无敌大蜜瓜)
ja_jp: のんびり全自動釣り (原作者: Bilibili 無敵大蜜瓜)
ko_kr: 느긋한 자동 낚시 (원작자: Bilibili 無敵大蜜瓜)
zh_tw: 無悠閒全自動釣魚 (原作者: B站無敵大蜜瓜)

# 自动避险
source: Auto Hazard Avoidance
es_es: Evitación Automática de Peligros
ja_jp: 自動危険回避
ko_kr: 자동 위험 회피
zh_tw: 自動避險

# 自动探险/无尽
source: Auto Exploration/Endless
es_es: Aventura Automática / Infinito
ja_jp: 自動探検 / エンドレス
ko_kr: 자동 탐험 / 무한
zh_tw: 自動探險/無盡

# 解密失败自动重开
source: Automatically restart when decryption fails
es_es: Reinicio automático cuando falla el descifrado
ja_jp: 復号化失敗時に自動再起動
ko_kr: 복호화 실패 시 자동 재시작
zh_tw: 解密失敗自動重開

# 不重开时会发出声音提示
source: A sound prompt will be issued when No is selected.
es_es: Se emitirá un sonido de aviso cuando se seleccione No
ja_jp: 「いいえ」を選択すると音声で通知されます
ko_kr: 아니오 를 선택할 때 소리로 알림이 발생합니다
zh_tw: 不重開時會發出聲音提示

source: Dodge Key
es_es: Tecla de Esquivar
ja_jp: 回避キー
ko_kr: 회피 키
zh_tw: 閃避按鍵

source: HelixLeap Key
es_es: Tecla de Salto Hélice
ja_jp: ヘリックスリープキー
ko_kr: 나선 도약 키
zh_tw: 螺旋飛躍按鍵

source: Interact Key
es_es: Tecla de Interactuar
ja_jp: インタラクトキー
ko_kr: 상호작용 키
zh_tw: 互動按鍵

# 【30火&60火】-密函线索
source: 【30 Fire & 60 Fire】-Casket Clue
es_es: 【30 Fuego y 60 Fuego】-Pista de Cofre
ja_jp: 【30火&60火】-密函の手がかり
ko_kr: 【30불&60불】-밀함 단서

# 【50mod】-中速-水母-主控可调
source: 【50mod】-Medium Speed-Jellyfish-Main Control Adjustable
es_es: 【50mod】-Velocidad media-Medusa-Control principal ajustable
ja_jp: 【50mod】-中速-クラゲ-メイン操作調整可能
ko_kr: 【50mod】-중속-해파리-주 제어 조절 가능

# 【55&80mod】-磐石水母-主控可调
source: 【55&80mod】-Rock Jellyfish-Main Control Adjustable
es_es: 【55&80mod】-Roca Medusa-Control principal ajustable
ja_jp: 【55&80mod】-岩石クラゲ-メイン操作調整可能
ko_kr: 【55&80mod】-반석 해파리-주 제어 조절 가능

# 【60mod&驱离-密函】-水母-主控可调（不要带黎瑟协战）-超时建议90s
source: 【60mod&Expulsion-Casket】-Jellyfish-Main Control Adjustable (Don't bring Lise in co-op)-Timeout recommended 90s
es_es: 【60mod&Repeler-Cofre】-Medusa-Control principal ajustable (No llevar a Lise en cooperativo)-Tiempo de espera recomendado 90s
ja_jp: 【60mod&駆除-密函】-クラゲ-メイン操作調整可能（リーゼの協力を入れないでください）-タイムアウト推奨90秒
ko_kr: 【60mod&퇴치-밀함】-해파리-주 제어 조절 가능 (리세 협동 전투 데려가지 마세요)-타임아웃 90초 권장

# 【60角色经验】-磐石水母
source: 【60 Character EXP】-Rock Jellyfish
es_es: 【60 EXP de Personaje】-Roca Medusa
ja_jp: 【60キャラクター経験値】-岩石クラゲ
ko_kr: 【60 캐릭터 경험치】-반석 해파리

# 【65mod】-黎瑟主控（或者水母主控带个黎瑟助战）
source: 【65mod】-Lise Main Control (or Jellyfish main control with Lise support)
es_es: 【65mod】-Control principal Lise (o control principal Medusa con Lise de apoyo)
ja_jp: 【65mod】-リーゼメイン操作（またはクラゲメイン操作でリーゼを協力に）
ko_kr: 【65mod】-리세 주 제어 (또는 해파리 주 제어에 리세 지원)

# 【70jjb】-中低速-水母-主控可调
source: 【70sc】-Medium-Low Speed-Jellyfish-Main Control Adjustable
es_es: 【70mc】-Velocidad media-baja-Medusa-Control principal ajustable
ja_jp: 【70jjb】-中低速-クラゲ-メイン操作調整可能
ko_kr: 【70jjb】-중저속-해파리-주 제어 조절 가능

# 【密函-拆解】-无巧手版-280范围水母
source: 【Casket-Disassembly】-No Skillful version-280 range Jellyfish
es_es: 【Cofre-Desmontaje】-Versión sin Habilidad-Medusa rango 280
ja_jp: 【密函-分解】-器用さなし版-280範囲クラゲ
ko_kr: 【밀함-해체】-재주 없음 버전-280 범위 해파리

# 【密函-拆解】-需巧手-280范围水母
source: 【Casket-Disassembly】-Skillful required-280 range Jellyfish
es_es: 【Cofre-Desmontaje】-Requiere Habilidad-Medusa rango 280
ja_jp: 【密函-分解】-器用さ必要-280範囲クラゲ
ko_kr: 【밀함-해체】-재주 필요-280 범위 해파리

# 【无飞枪80红豆（有巧手可后台）】-磐石黎瑟-使用前看文件夹内说明-超时建议5~10s
source: 【No Flying Spear 80 Red Bean (Skillful can run in background)】-Rock Lise-Read instructions in folder before use-Timeout recommended 5~10s
es_es: 【Sin Lanza Voladora 80 Frijol Rojo (con Habilidad puede ejecutarse en segundo plano)】-Roca Lise-Leer instrucciones en la carpeta antes de usar-Tiempo de espera recomendado 5~10s
ja_jp: 【飛槍なし80小豆（器用さあればバックグラウンド可）】-岩石リーゼ-使用前にフォルダ内の説明をお読みください-タイムアウト推奨5～10秒
ko_kr: 【비행창 없음 80 팥 (재주 있으면 백그라운드 가능)】-반석 리세-사용 전 폴더 내 설명 참조-타임아웃 5~10초 권장

# 【武器材料60&70】-磐石水母-超时建议20s
source: 【Weapon Material 60&70】-Rock Jellyfish-Timeout recommended 20s
es_es: 【Material de Arma 60&70】-Roca Medusa-Tiempo de espera recomendado 20s
ja_jp: 【武器素材60&70】-岩石クラゲ-タイムアウト推奨20秒
ko_kr: 【무기 재료 60&70】-반석 해파리-타임아웃 20초 권장

# 【武器经验50】-磐石水母-超时建议20s
source: 【Weapon EXP 50】-Rock Jellyfish-Timeout recommended 20s
es_es: 【EXP de Arma 50】-Roca Medusa-Tiempo de espera recomendado 20s
ja_jp: 【武器経験値50】-岩石クラゲ-タイムアウト推奨20秒
ko_kr: 【무기 경험치 50】-반석 해파리-타임아웃 20초 권장
